wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_fmc.c
/*!
    \file    gd32f50x_fmc.c
    \brief   FMC driver

    \version 2025-11-10, V1.0.1, firmware for GD32F50x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/


#include "gd32f50x_fmc.h"

/* OB_USER_RESET_VALUE: Default reset value for the user option byte (0x9F) */
#define OB_USER_RESET_VALUE     ((uint32_t)0x9FU)
/* OB_USER_POS: Bit position of the user option byte (bit 2) */
#define OB_USER_POS             ((uint32_t)2U)
/* OB_DATA_RESET_VALUE: Default reset value for the user data byte (0xFF) */
#define OB_DATA_RESET_VALUE     ((uint32_t)0xFFFFU)
/* OB_DATA_POS: Bit position of the user data byte (bit 10) */
#define OB_DATA_POS             ((uint32_t)10U)

/*!
    \brief      unlock the main FMC operation (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_unlock(void)
{
    if((RESET != (FMC_CTL0 & FMC_CTL0_LK))) {
        /* write the FMC unlock key */
        FMC_KEY0 = UNLOCK_KEY0;
        FMC_KEY0 = UNLOCK_KEY1;
    }
    if(FMC_BANK0_SIZE < FMC_SIZE) {
        /* write the FMC unlock key */
        if(RESET != (FMC_CTL1 & FMC_CTL1_LK)) {
            FMC_KEY1 = UNLOCK_KEY0;
            FMC_KEY1 = UNLOCK_KEY1;
        }
    }
}

/*!
    \brief      unlock the FMC bank0 operation (API_ID(0x0002U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_bank0_unlock(void)
{
    if((RESET != (FMC_CTL0 & FMC_CTL0_LK))) {
        /* write the FMC unlock key */
        FMC_KEY0 = UNLOCK_KEY0;
        FMC_KEY0 = UNLOCK_KEY1;
    }
}

/*!
    \brief      unlock the FMC bank1 operation (API_ID(0x0003U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_bank1_unlock(void)
{
    if((RESET != (FMC_CTL1 & FMC_CTL1_LK))) {
        /* write the FMC unlock key */
        FMC_KEY1 = UNLOCK_KEY0;
        FMC_KEY1 = UNLOCK_KEY1;
    }
}

/*!
    \brief      lock the main FMC operation (API_ID(0x0004U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_lock(void)
{
    /* set the LK bit */
    FMC_CTL0 |= FMC_CTL0_LK;
    if(FMC_BANK0_SIZE < FMC_SIZE) {
        /* set the LK bit */
        FMC_CTL1 |= FMC_CTL1_LK;
    }
}

/*!
    \brief      lock the FMC bank0 operation (API_ID(0x0005U))
                this function can be used for all gd32f50x devices.
                for gd32f50x with flash more than 512KB, this function locks bank0.
                for gd32f50x with flash no more than 512KB and it is equivalent to fmc_lock function.
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_bank0_lock(void)
{
    /* set the LK bit*/
    FMC_CTL0 |= FMC_CTL0_LK;
}

/*!
    \brief      lock the FMC bank1 operation (API_ID(0x0006U))
                this function can be used for gd32f50x with flash more than 512KB.
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_bank1_lock(void)
{
    /* set the LK bit*/
    FMC_CTL1 |= FMC_CTL1_LK;
}

/*!
    \brief      erase page (API_ID(0x0007U))
    \param[in]  page_address: the page address to be erased.
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
*/
fmc_state_enum fmc_page_erase(uint32_t page_address)
{
    fmc_state_enum fmc_state;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_PAGE_VALID_ADDRESS(page_address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(FMC_BANK0_SIZE < FMC_SIZE) {
            if(FMC_BANK0_END_ADDRESS > page_address) {
                fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
                /* if the last operation is completed, start page erase */
                if(FMC_READY == fmc_state) {
                    FMC_CTL0 |= FMC_CTL0_PER;
                    FMC_ADDR0 = page_address;
                    FMC_CTL0 |= FMC_CTL0_START;
                    __NOP();
                    __NOP();
                    /* wait for the FMC ready */
                    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
                    /* reset the PER bit */
                    FMC_CTL0 &= ~FMC_CTL0_PER;
                }
            } else {
                /* wait for the FMC ready */
                fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
                /* if the last operation is completed, start page erase */
                if(FMC_READY == fmc_state) {
                    FMC_CTL1 |= FMC_CTL1_PER;
                    FMC_ADDR1 = page_address;
                    FMC_CTL1 |= FMC_CTL1_START;
                    __NOP();
                    __NOP();
                    /* wait for the FMC ready */
                    fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
                    /* reset the PER bit */
                    FMC_CTL1 &= ~FMC_CTL1_PER;
                }
            }
        } else {
            fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
            /* if the last operation is completed, start page erase */
            if(FMC_READY == fmc_state) {
                FMC_CTL0 |= FMC_CTL0_PER;
                FMC_ADDR0 = page_address;
                FMC_CTL0 |= FMC_CTL0_START;
                __NOP();
                __NOP();
                /* wait for the FMC ready */
                fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
                /* reset the PER bit */
                FMC_CTL0 &= ~FMC_CTL0_PER;
            }
        }
    }
    return fmc_state;
}

/*!
    \brief      erase whole chip (API_ID(0x0008U))
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
*/
fmc_state_enum fmc_mass_erase(void)
{
    fmc_state_enum fmc_state;
    if(FMC_BANK0_SIZE < FMC_SIZE) {
        /* erase bank0 */
        fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
        if(FMC_READY == fmc_state) {
            /* start whole chip erase */
            FMC_CTL0 |= FMC_CTL0_MER;
            FMC_CTL0 |= FMC_CTL0_START;
            /* wait for the FMC ready */
            fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
            /* reset the MER bit */
            FMC_CTL0 &= ~FMC_CTL0_MER;
        }
        /* erase bank1 */
        fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
        if(FMC_READY == fmc_state) {
            /* start whole chip erase */
            FMC_CTL1 |= FMC_CTL1_MER;
            FMC_CTL1 |= FMC_CTL1_START;
            /* wait for the FMC ready */
            fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
            /* reset the MER bit */
            FMC_CTL1 &= ~FMC_CTL1_MER;
        }
    } else {
        /* erase bank0 */
        fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
        if(FMC_READY == fmc_state) {
            /* start whole chip erase */
            FMC_CTL0 |= FMC_CTL0_MER;
            FMC_CTL0 |= FMC_CTL0_START;
            /* wait for the FMC ready */
            fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
            /* reset the MER bit */
            FMC_CTL0 &= ~FMC_CTL0_MER;
        }
    }
    /* return the FMC state  */
    return fmc_state;
}

/*!
    \brief      erase bank0 (API_ID(0x0009U))
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
*/
fmc_state_enum fmc_bank0_erase(void)
{
    fmc_state_enum fmc_state = FMC_READY;
    /* wait for the FMC ready */
    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* start FMC bank0 erase */
        FMC_CTL0 |= FMC_CTL0_MER;
        FMC_CTL0 |= FMC_CTL0_START;
        /* wait for the FMC ready */
        fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
        /* reset the MER bit */
        FMC_CTL0 &= ~FMC_CTL0_MER;
    }
    /* return the fmc state */
    return fmc_state;
}

/*!
    \brief      erase bank1 (API_ID(0x000AU))
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
*/
fmc_state_enum fmc_bank1_erase(void)
{
    fmc_state_enum fmc_state = FMC_READY;
    /* wait for the FMC ready */
    fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* start FMC bank1 erase */
        FMC_CTL1 |= FMC_CTL1_MER;
        FMC_CTL1 |= FMC_CTL1_START;
        /* wait for the FMC ready */
        fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
        /* reset the MER bit */
        FMC_CTL1 &= ~FMC_CTL1_MER;
    }
    /* return the fmc state */
    return fmc_state;
}

/*!
    \brief      program a word at the corresponding address (API_ID(0x000BU))
    \param[in]  address: address to program
    \param[in]  data: word to program
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
*/
fmc_state_enum fmc_word_program(uint32_t address, uint32_t data)
{
    fmc_state_enum fmc_state = FMC_READY;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_FLASH_WORD_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000BU), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(FMC_BANK0_SIZE < FMC_SIZE) {
            if(FMC_BANK0_END_ADDRESS > address) {
                fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
                if(FMC_READY == fmc_state) {
                    /* set the PG bit to start program */
                    FMC_CTL0 |= FMC_CTL0_PG;
                    REG32(address) = data;
                    /* wait for the FMC ready */
                    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
                    /* reset the PG bit */
                    FMC_CTL0 &= ~FMC_CTL0_PG;
                }
            } else {
                fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
                if(FMC_READY == fmc_state) {
                    /* set the PG bit to start program */
                    FMC_CTL1 |= FMC_CTL1_PG;
                    REG32(address) = data;
                    /* wait for the FMC ready */
                    fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
                    /* reset the PG bit */
                    FMC_CTL1 &= ~FMC_CTL1_PG;
                }
            }
        } else {
            fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_READY == fmc_state) {
                /* set the PG bit to start program */
                FMC_CTL0 |= FMC_CTL0_PG;
                REG32(address) = data;
                /* wait for the FMC ready */
                fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
                /* reset the PG bit */
                FMC_CTL0 &= ~FMC_CTL0_PG;
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program a half word at the corresponding address (API_ID(0x000CU))
    \param[in]  address: address to program
    \param[in]  data: halfword to program
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
*/
fmc_state_enum fmc_halfword_program(uint32_t address, uint16_t data)
{
    fmc_state_enum fmc_state = FMC_READY;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_FLASH_HALFWORD_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000CU), ERR_PARAM_INVALID);
    } else
#endif
    {
        if(FMC_BANK0_SIZE < FMC_SIZE) {
            if(FMC_BANK0_END_ADDRESS > address) {
                fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
                if(FMC_READY == fmc_state) {
                    /* set the PG bit to start program */
                    FMC_CTL0 |= FMC_CTL0_PG;
                    REG16(address) = data;
                    /* wait for the FMC ready */
                    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
                    /* reset the PG bit */
                    FMC_CTL0 &= ~FMC_CTL0_PG;
                }
            } else {
                fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
                if(FMC_READY == fmc_state) {
                    /* set the PG bit to start program */
                    FMC_CTL1 |= FMC_CTL1_PG;
                    REG16(address) = data;
                    /* wait for the FMC ready */
                    fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
                    /* reset the PG bit */
                    FMC_CTL1 &= ~FMC_CTL1_PG;
                }
            }
        } else {
            fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
            if(FMC_READY == fmc_state) {
                /* set the PG bit to start program */
                FMC_CTL0 |= FMC_CTL0_PG;
                REG16(address) = data;
                /* wait for the FMC ready */
                fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
                /* reset the PG bit */
                FMC_CTL0 &= ~FMC_CTL0_PG;
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program a word at the OTP address (API_ID(0x000DU))
    \param[in]  address: OTP address to program
    \param[in]  data: word to program
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
*/
fmc_state_enum fmc_otp_word_program(uint32_t address, uint32_t data)
{
    fmc_state_enum fmc_state = FMC_READY;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_OTP_WORD_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000DU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        if(((address >= OTP1_DATA_BLOCK_BASE_ADDRESS) && (address <= OTP1_DATA_BLOCK_END_ADDRESS)) || \
                ((address >= OTP2_DATA_BLOCK_BASE_ADDRESS) && (address <= OTP2_DATA_BLOCK_END_ADDRESS)) || \
                ((address >= OTP3_DATA_BLOCK_BASE_ADDRESS) && (address <= OTP3_DATA_BLOCK_END_ADDRESS)) || \
                ((address >= OTP3_LOCK_BLOCK_BASE_ADDRESS) && (address <= OTP3_LOCK_BLOCK_END_ADDRESS))) {
            fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
            if(FMC_READY == fmc_state) {
                /* set the PG bit to start program */
                FMC_CTL0 |= FMC_CTL0_PG;
                REG32(address) = data;
                /* wait for the FMC ready */
                fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
                /* reset the PG bit */
                FMC_CTL0 &= ~FMC_CTL0_PG;
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program a half word at the OTP address (API_ID(0x000EU))
    \param[in]  address: OTP address to program
    \param[in]  data: halfword to program
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
*/
fmc_state_enum fmc_otp_half_word_program(uint32_t address, uint16_t data)
{
    fmc_state_enum fmc_state = FMC_READY;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_OTP_HALFWORD_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000EU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        if(((address >= OTP1_DATA_BLOCK_BASE_ADDRESS) && (address <= OTP1_DATA_BLOCK_END_ADDRESS)) || \
                ((address >= OTP2_DATA_BLOCK_BASE_ADDRESS) && (address <= OTP2_DATA_BLOCK_END_ADDRESS))) {
            fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
            if(FMC_READY == fmc_state) {
                /* set the PG bit to start program */
                FMC_CTL0 |= FMC_CTL0_PG;
                REG16(address) = data;
                /* wait for the FMC ready */
                fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
                /* reset the PG bit */
                FMC_CTL0 &= ~FMC_CTL0_PG;
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program a byte at the OTP address (API_ID(0x000FU))
    \param[in]  address: OTP address to program
    \param[in]  data: byte to program(0x00 - 0xFF)
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
*/
fmc_state_enum fmc_otp_byte_program(uint32_t address, uint8_t data)
{
    fmc_state_enum fmc_state = FMC_READY;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_FMC_OTP_BYTE_ADDRESS(address)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000FU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* check if address is in valid OTP regions */
        if(((address >= OTP0_DATA_BLOCK_BASE_ADDRESS) && (address <= OTP0_DATA_BLOCK_END_ADDRESS)) || \
                ((address >= OTP0_LOCK_BLOCK_BASE_ADDRESS) && (address <= OTP0_LOCK_BLOCK_END_ADDRESS)) || \
                ((address >= OTP1_DATA_BLOCK_BASE_ADDRESS) && (address <= OTP1_DATA_BLOCK_END_ADDRESS)) || \
                ((address >= OTP1_LOCK_BLOCK_BASE_ADDRESS) && (address <= OTP1_LOCK_BLOCK_END_ADDRESS)) || \
                ((address >= OTP2_DATA_BLOCK_BASE_ADDRESS) && (address <= OTP2_DATA_BLOCK_END_ADDRESS)) || \
                ((address >= OTP2_WLOCK_BLOCK_BASE_ADDRESS) && (address <= OTP2_RLOCK_BLOCK_END_ADDRESS))) {
            /* wait for the FMC ready */
            fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
            if(FMC_READY == fmc_state) {
                /* set the PG bit to start program */
                FMC_CTL0 |= FMC_CTL0_PG;
                REG8(address) = data;
                /* wait for the FMC ready */
                fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
                /* reset the PG bit */
                FMC_CTL0 &= ~FMC_CTL0_PG;
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      enable no waiting time area load after system reset (API_ID(0x0010U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_nwa_enable(void)
{
    FMC_CTL0 |= FMC_CTL0_NWLDE;
}

/*!
    \brief      disable no waiting time area load after system reset (API_ID(0x0011U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_nwa_disable(void)
{
    FMC_CTL0 &= ~FMC_CTL0_NWLDE;
}

/*!
    \brief      set OTP1 data block not be read (API_ID(0x0012U))
    \param[in]  block: specify OTP1 data block x not be read
                one or more parameters can be selected which are shown as below:
        \arg    OTP1_DATA_BLOCK_x: data block x(x = 0,1,2...15)
        \arg    OTP1_DATA_BLOCK_ALL: all data blocks
    \param[out] none
    \retval     none
*/
void otp1_read_disable(uint32_t block)
{
    FMC_OTP1CFG &= ~block;
}

/*!
    \brief      enable read lock block protection for OTP2 (API_ID(0x0013U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void otp2_rlock_enable(void)
{
    FMC_CTL0 |= FMC_CTL0_RLBE;
}

/*!
    \brief      enable deep power down mode when no operation (API_ID(0x0014U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_deep_power_down_enable(void)
{
    FMC_CTL0 |= FMC_CTL0_PWDN;
}

/*!
    \brief      disable deep power down mode when no operation (API_ID(0x0015U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_deep_power_down_disable(void)
{
    FMC_CTL0 &= ~FMC_CTL0_PWDN;
}

/*!
    \brief      unlock the option byte operation (API_ID(0x0016U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_unlock(void)
{
    if(RESET != (FMC_OBCTL0 & FMC_OBCTL0_OB_LK)) {
        /* write the FMC key */
        FMC_OBKEY = UNLOCK_KEY0;
        FMC_OBKEY = UNLOCK_KEY1;
    }
}

/*!
    \brief      lock the option byte operation (API_ID(0x0017U))
    \param[in]  none
    \param[out] none
    \retval     none
    \Note: Before setting FMC_OBCTL0_OB_LK, FMC_CTL0_LK should first be set using fmc_lock/fmc_bank0_lock.
*/
void ob_lock(void)
{
    /* set the OBWEN bit */
    FMC_OBCTL0 |= FMC_OBCTL0_OB_LK;
}

/*!
    \brief      send option byte change command (API_ID(0x0018U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_start(void)
{
    /* set the OB_START bit in OBCTL0 register */
    FMC_OBCTL0 |= FMC_OBCTL0_OB_START;
}

/*!
    \brief      erase the option byte (API_ID(0x0019U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_erase(void)
{
    fmc_state_enum fmc_state = FMC_READY;
    /* wait for the FMC ready */
    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
    if(FMC_READY == fmc_state) {
        /* reset the OBCTL0_SPC */
        FMC_OBCTL0 &= ~FMC_OBCTL0_SPC;
        FMC_OBCTL0 |= (FMC_NSPC & FMC_OBCTL0_SPC);
        /* reset the NWDG_HW, NRST_DPSLP, NRST_STDBY, BB and DATA*/
        FMC_OBCTL1 = (OB_USER_RESET_VALUE << OB_USER_POS) | (OB_DATA_RESET_VALUE << OB_DATA_POS);
        /* reset wp value */
        FMC_OBCTL2 |= OB_WP_ALL;
    }
}

/*!
    \brief      enable write protection (API_ID(0x001AU))
    \param[in]  ob_wp: specify pages to be write protected
                one or more parameters can be selected which are shown as below:
      \arg        OB_WP_x(x=0..31):page 2*x/ page2*x+1(x = 0,1,2...31)
      \arg        OB_WP_ALL: all pages
    \param[out] none
    \retval     SUCCESS or ERROR
*/
ErrStatus ob_write_protection_enable(uint32_t ob_wp)
{
    ErrStatus revet;
    fmc_state_enum fmc_state;
    /* wait for the FMC ready */
    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
    if(FMC_READY == fmc_state) {
        FMC_OBCTL2 &= ~ob_wp;
        revet = SUCCESS;
    } else {
        revet = ERROR;
    }
    return revet;
}

/*!
    \brief      disable write protection (API_ID(0x001BU))
    \param[in]  ob_wp: specify pages to be write protected
                one or more parameters can be selected which are shown as below:
      \arg        OB_WP_x(x=0..31):page 2*x/ page2*x+1(x = 0,1,2...31)
      \arg        OB_WP_ALL: all pages
    \param[out] none
    \retval     SUCCESS or ERROR
*/
ErrStatus ob_write_protection_disable(uint32_t ob_wp)
{
    ErrStatus revet;
    fmc_state_enum fmc_state = FMC_READY;
    /* wait for the FMC ready */
    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
    if(FMC_READY == fmc_state) {
        FMC_OBCTL2 |= ob_wp;
        revet = SUCCESS;
    } else {
        revet = ERROR;
    }
    return revet;
}

