wajmh/Code/Firmware/GD32F50x_Firmware_Library/Firmware/GD32F50x_standard_peripheral/Source/gd32f50x_fmc.c
/*!
    \brief      configure security protection level (API_ID(0x001CU))
    \param[in]  ob_spc: specify security protection level
                only one parameter can be selected which is shown as below:
      \arg        FMC_NSPC: no security protection
      \arg        FMC_LSPC: low security protection
      \arg        FMC_HSPC: high security protection
    \param[out] none
    \retval     none
*/
void ob_security_protection_config(uint32_t ob_spc)
{
    fmc_state_enum fmc_state = FMC_READY;
    /* wait for the FMC ready */
    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
    if(FMC_READY == fmc_state) {
        /* reset the OBCTL0_SPC, set according to ob_spc */
        FMC_OBCTL0 &= ~FMC_OBCTL0_SPC;
        FMC_OBCTL0 |= (ob_spc & FMC_OBCTL0_SPC);
    }
}

/*!
    \brief      program the FMC user option byte (API_ID(0x001DU))
    \param[in]  ob_fwdgt: option byte watchdog value
                only one parameter can be selected which is shown as below:
      \arg        OB_FWDGT_SW: software free watchdog
      \arg        OB_FWDGT_HW: hardware free watchdog
    \param[in]  ob_deepsleep: option byte deepsleep reset value
                only one parameter can be selected which is shown as below:
      \arg        OB_DEEPSLEEP_NRST: no reset when entering deepsleep mode
      \arg        OB_DEEPSLEEP_RST: generate a reset instead of entering deepsleep mode
    \param[in]  ob_stdby:option byte standby reset value
                only one parameter can be selected which is shown as below:
      \arg        OB_STDBY_NRST: no reset when entering standby mode
      \arg        OB_STDBY_RST: generate a reset instead of entering standby mode
    \param[out] none
    \retval     none
*/
void ob_user_write(uint32_t ob_fwdgt, uint32_t ob_deepsleep, uint32_t ob_stdby)
{
    fmc_state_enum fmc_state = FMC_READY;
    /* wait for the FMC ready */
    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* reset the OB_FWDGT, OB_DEEPSLEEP and OB_STDBY, set according to ob_fwdgt, ob_deepsleep and ob_stdby */
        FMC_OBCTL1 &= ~(FMC_OBCTL1_NWDG_HW | FMC_OBCTL1_NRST_DPSLP | FMC_OBCTL1_NRST_STDBY);
        FMC_OBCTL1 |= ((ob_fwdgt | ob_deepsleep | ob_stdby) & (FMC_OBCTL1_NWDG_HW | FMC_OBCTL1_NRST_DPSLP | FMC_OBCTL1_NRST_STDBY));
    }
}

/*!
    \brief      configure the option byte sram initialize value (API_ID(0x001EU))
    \param[in]  init_mode: specifies the option byte sram initialize value
                only one parameter can be selected which is shown as below:
      \arg        OB_SRAM_INI_ENABLE: sram initialize after power reset
      \arg        OB_SRAM_INI_DISABLE: sram not initialized after power reset
    \param[out] none
    \retval     none
*/
void ob_sram_init_config(uint32_t init_mode)
{
    FMC_OBCTL1 &= ~FMC_OBCTL1_SRAM_RST;
    FMC_OBCTL1 |= (init_mode & FMC_OBCTL1_SRAM_RST);
}

/*!
    \brief      configure the option byte sram ecc enable value (API_ID(0x001FU))
    \param[in]  ecc_mode: specifies the option byte sram ecc function value
                only one parameter can be selected which is shown as below:
      \arg        OB_SRAMECC_DISABLE: SRAM ECC disable
      \arg        OB_SRAMECC_ENABLE: SRAM ECC enable
    \param[out] none
    \retval     none
*/
void ob_sram_ecc_config(uint32_t ecc_mode)
{
    FMC_OBCTL1 &= ~FMC_OBCTL1_ECC_EN;
    FMC_OBCTL1 |= (ecc_mode & FMC_OBCTL1_ECC_EN);
}

/*!
    \brief      configure the option byte the clock for loading no waiting time area (API_ID(0x0020U))
    \param[in]  clock_mode: specifies the clock after Power reset when read flash to memory
                only one parameter can be selected which is shown as below:
      \arg        PLL_CLK_200M: 200M from PLL
      \arg        PLL_CLK_160M: 160M from PLL
      \arg        PLL_CLK_120M: 120M from PLL
      \arg        IRC8M_CLK_8M: 8M from IRC8M
    \param[out] none
    \retval     none
*/
void ob_nwa_clock_config(uint32_t clock_mode)
{
    FMC_OBCTL1 &= ~FMC_OBCTL1_NWLD_SEL;
    FMC_OBCTL1 |= (clock_mode & FMC_OBCTL1_NWLD_SEL);
}

/*!
    \brief      program option bytes data (API_ID(0x0021U))
    \param[in]  data: data to program
    \param[out] none
    \retval     none
*/
void ob_data_write(uint16_t data)
{
    fmc_state_enum fmc_state = FMC_READY;
    /* wait for the FMC ready */
    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* reset the data */
        FMC_OBCTL1 &= ~FMC_OBCTL1_DATA;
        FMC_OBCTL1 |= (((uint32_t)data << OB_DATA_POS) & FMC_OBCTL1_DATA);
    }
}

/*!
    \brief      get the option byte sram initialize value (API_ID(0x0022U))
    \param[in]  none
    \param[out] none
    \retval     the option byte sram initialize value
*/
uint32_t ob_sram_init_get(void)
{
    return (FMC_OBCTL1 & FMC_OBCTL1_SRAM_RST);
}

/*!
    \brief      get the option byte sram ecc enable value (API_ID(0x0023U))
    \param[in]  none
    \param[out] none
    \retval     the option byte sram ecc function value
*/
uint32_t ob_sram_ecc_get(void)
{
    return (FMC_OBCTL1 & FMC_OBCTL1_ECC_EN);
}

/*!
    \brief      get the option byte the clock for loading no waiting time area (API_ID(0x0024U))
    \param[in]  none
    \param[out] none
    \retval     the option byte the clock for loading no waiting time area value
*/
uint32_t ob_nwa_clock_get(void)
{
    return (FMC_OBCTL1 & FMC_OBCTL1_NWLD_SEL);
}

/*!
    \brief      get the FMC data option byte (API_ID(0x0025U))
    \param[in]  none
    \param[out] none
    \retval     the FMC data option byte
*/
uint16_t ob_data_get(void)
{
    return (uint16_t)((FMC_OBCTL1 & FMC_OBCTL1_DATA) >> 10U);
}

/*!
    \brief      get the FMC option byte write protection (API_ID(0x0026U))
    \param[in]  none
    \param[out] none
    \retval     uint32_t: the FMC option byte write protection
*/
uint32_t ob_write_protection_get(void)
{
    return (FMC_OBCTL2);
}

/*!
    \brief      get option byte security protection code value (API_ID(0x0027U))
    \param[in]  none
    \param[out] none
    \retval     uint32_t: the option byte security protection code value
                FMC_NSPC: no security protection
                FMC_LSPC: low security protection
                FMC_HSPC: high security protection
*/
uint32_t ob_spc_get(void)
{
    return (FMC_OBCTL0 & FMC_OBCTL0_SPC);
}

/*!
    \brief      check flag is set or not (API_ID(0x0028U))
    \param[in]  flag: check FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_FLAG_BANK0_BUSY: FMC bank0 busy flag bit
      \arg        FMC_FLAG_BANK0_PGERR: FMC bank0 operation error flag bit
      \arg        FMC_FLAG_BANK0_WPERR: FMC bank0 erase/program protection error flag bit
      \arg        FMC_FLAG_BANK0_END: FMC bank0 end of operation flag bit
      \arg        FMC_FLAG_OBERR: FMC option bytes read error flag bit
      \arg        FMC_FLAG_BANK1_BUSY: FMC bank1 busy flag bit
      \arg        FMC_FLAG_BANK1_PGERR: FMC bank1 operation error flag bit
      \arg        FMC_FLAG_BANK1_WPERR: FMC bank1 erase/program protection error flag bit
      \arg        FMC_FLAG_BANK1_END: FMC bank1 end of operation flag bit
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_flag_get(fmc_flag_enum flag)
{
    FlagStatus revet;
    if(RESET != (FMC_REG_VAL(flag) & BIT(FMC_BIT_POS(flag)))) {
        revet = SET;
    } else {
        revet = RESET;
    }
    return revet;
}

/*!
    \brief      clear the FMC flag (API_ID(0x0029U))
    \param[in]  flag: clear FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_FLAG_BANK0_PGERR: FMC bank0 operation error flag bit
      \arg        FMC_FLAG_BANK0_WPERR: FMC bank0 erase/program protection error flag bit
      \arg        FMC_FLAG_BANK0_END: FMC bank0 end of operation flag bit
      \arg        FMC_FLAG_BANK1_PGERR: FMC bank1 operation error flag bit
      \arg        FMC_FLAG_BANK1_WPERR: FMC bank1 erase/program protection error flag bit
      \arg        FMC_FLAG_BANK1_END: FMC bank1 end of operation flag bit
    \param[out] none
    \retval     none
*/
void fmc_flag_clear(fmc_flag_enum flag)
{
    FMC_REG_VAL(flag) |= BIT(FMC_BIT_POS(flag));
}

/*!
    \brief      enable FMC interrupt (API_ID(0x002AU))
    \param[in]  interrupt: the FMC interrupt source
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_BANK0_END: enable FMC bank0 end of operation
      \arg        FMC_INT_BANK0_ERR: enable FMC bank0 error interrupt
      \arg        FMC_INT_BANK1_END: enable FMC bank1 end of operation
      \arg        FMC_INT_BANK1_ERR: enable FMC bank1 error interrupt
    \param[out] none
    \retval     none
*/
void fmc_interrupt_enable(fmc_interrupt_enum interrupt)
{
    FMC_REG_VAL(interrupt) |= BIT(FMC_BIT_POS(interrupt));
}

/*!
    \brief      disable FMC interrupt (API_ID(0x002BU))
    \param[in]  interrupt: the FMC interrupt source
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_BANK0_END: enable FMC bank0 end of operation
      \arg        FMC_INT_BANK0_ERR: enable FMC bank0 error interrupt
      \arg        FMC_INT_BANK1_END: enable FMC bank1 end of operation
      \arg        FMC_INT_BANK1_ERR: enable FMC bank1 error interrupt
    \param[out] none
    \retval     none
*/
void fmc_interrupt_disable(fmc_interrupt_enum interrupt)
{
    FMC_REG_VAL(interrupt) &= ~BIT(FMC_BIT_POS(interrupt));
}

/*!
    \brief      get FMC interrupt flag state (API_ID(0x002CU))
    \param[in]  flag: FMC interrupt flags, refer to fmc_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_FLAG_BANK0_PGERR: FMC bank0 operation error interrupt flag bit
      \arg        FMC_INT_FLAG_BANK0_WPERR: FMC bank0 erase/program protection error interrupt flag bit
      \arg        FMC_INT_FLAG_BANK0_END: FMC bank0 end of operation interrupt flag bit
      \arg        FMC_INT_FLAG_BANK1_PGERR: FMC bank1 operation error interrupt flag bit
      \arg        FMC_INT_FLAG_BANK1_WPERR: FMC bank1 erase/program protection error interrupt flag bit
      \arg        FMC_INT_FLAG_BANK1_END: FMC bank1 end of operation interrupt flag bit
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_interrupt_flag_get(fmc_interrupt_flag_enum flag)
{
    FlagStatus revet;
    uint32_t ret1;
    uint32_t ret2;
    if(FMC_STAT0_REG_OFFSET == FMC_REG_OFFSET_GET(flag)) {
        /* get the status of interrupt flag */
        ret1 = FMC_REG_VALS(flag) & BIT(FMC_BIT_POS0(flag));
        /* get the status of interrupt enable bit */
        ret2 = FMC_CTL0 & BIT(FMC_BIT_POS1(flag));
    } else {
        /* get the status of interrupt flag */
        ret1 = FMC_REG_VALS(flag) & BIT(FMC_BIT_POS0(flag));
        /* get the status of interrupt enable bit */
        ret2 = FMC_CTL1 & BIT(FMC_BIT_POS1(flag));
    }

    if((ret1 != 0U) && (ret2 != 0U)) {
        revet = SET;
    } else {
        revet = RESET;
    }
    return revet;
}

/*!
    \brief      clear FMC interrupt flag state (API_ID(0x002DU))
    \param[in]  flag: FMC interrupt flags, refer to fmc_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_FLAG_BANK0_PGERR: FMC bank0 operation error interrupt flag bit
      \arg        FMC_INT_FLAG_BANK0_WPERR: FMC bank0 erase/program protection error interrupt flag bit
      \arg        FMC_INT_FLAG_BANK0_END: FMC bank0 end of operation interrupt flag bit
      \arg        FMC_INT_FLAG_BANK1_PGERR: FMC bank1 operation error interrupt flag bit
      \arg        FMC_INT_FLAG_BANK1_WPERR: FMC bank1 erase/program protection error interrupt flag bit
      \arg        FMC_INT_FLAG_BANK1_END: FMC bank1 end of operation interrupt flag bit
    \param[out] none
    \retval     none
*/
void fmc_interrupt_flag_clear(fmc_interrupt_flag_enum flag)
{
    FMC_REG_VALS(flag) |= BIT(FMC_BIT_POS0(flag));
}

/*!
    \brief      get the FMC bank0 state (API_ID(0x002EU))
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
*/
fmc_state_enum fmc_bank0_state_get(void)
{
    fmc_state_enum fmc_state = FMC_READY;

    if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_BUSY)) {
        fmc_state = FMC_BUSY;
    } else {
        if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_WPERR)) {
            fmc_state = FMC_WPERR;
        } else {
            if((uint32_t)0x00U != (FMC_STAT0 & (FMC_STAT0_PGERR))) {
                fmc_state = FMC_PGERR;
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      get the FMC bank1 state (API_ID(0x002FU))
    \param[in]  none
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
*/
fmc_state_enum fmc_bank1_state_get(void)
{
    fmc_state_enum fmc_state = FMC_READY;

    if((uint32_t)0x00U != (FMC_STAT1 & FMC_STAT1_BUSY)) {
        fmc_state = FMC_BUSY;
    } else {
        if((uint32_t)0x00U != (FMC_STAT1 & FMC_STAT1_WPERR)) {
            fmc_state = FMC_WPERR;
        } else {
            if((uint32_t)0x00U != (FMC_STAT1 & FMC_STAT1_PGERR)) {
                fmc_state = FMC_PGERR;
            }
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      check whether FMC bank0 is ready or not (API_ID(0x0030U))
    \param[in]  timeout: count of loop
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum fmc_bank0_ready_wait(uint32_t timeout)
{
    fmc_state_enum fmc_state = FMC_READY;

    /* wait for FMC ready */
    do {
        /* get FMC state */
        fmc_state = fmc_bank0_state_get();
        timeout--;
    } while((FMC_BUSY == fmc_state) && (0x00U != timeout));

    if(FMC_BUSY == fmc_state) {
        fmc_state = FMC_TOERR;
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      check whether FMC bank1 is ready or not (API_ID(0x0031U))
    \param[in]  timeout: count of loop
    \param[out] none
    \retval     state of FMC, refer to fmc_state_enum
    \note       This function includes timeout exit scenarios.
                Modify according to the user's actual usage scenarios.
*/
fmc_state_enum fmc_bank1_ready_wait(uint32_t timeout)
{
    fmc_state_enum fmc_state = FMC_READY;

    /* wait for FMC ready */
    do {
        /* get FMC state */
        fmc_state = fmc_bank1_state_get();
        timeout--;
    } while((FMC_BUSY == fmc_state) && (0x00U != timeout));

    if(FMC_BUSY == fmc_state) {
        fmc_state = FMC_TOERR;
    }
    /* return the FMC state */
    return fmc_state;
}

